/**
 * =======================================================
 * Простой интерфейс к сложной библиотеке видеоконвертации
 * =======================================================
 * <ul>В этом примере Фасад упрощает работу клиента со сложной библиотекой видеоконвертации.</ul>
 *
 * <ul>Фасад предоставляет пользователю лишь один простой метод, скрывая за собой целую систему с видеокодеками, аудиомикшерами и другими не менее сложными объектами.</ul>
 */
package patterns.refactoring.guru.structural.facade.ex1;