/**
 * ---------------------------------------------------------------------------------------------------------------------
 * <p><strong>Редактор заметок</strong></p>
 * ---------------------------------------------------------------------------------------------------------------------
 *
 * <ul>Этот пример показывает как организовать множество элементов интерфейса при помощи посредника так, чтобы они не знали и не зависели друг от друга.</ul>
 */
package patterns.refactoring.guru.behavioral.mediator.ex1;